[
    {
        "_comment": "The definition of overbooking is that more than one patient can be booked at the same time slot.",
        "Title": "Optimal outpatient appointment scheduling with emergency arrivals and general service times",
        "Authors": "Paulien M. Koeleman, Ger M. Koole",
        "Year": 2012,
        "BibTex ID": "koeleman_optimal_2012",
        "Modeling Approach": {
            "time slot length": "fixed",
            "schedule format": "number of patients per time slot",
            "overbooking allowed": "yes",
            "service time": "general distribution",
            "no-shows assumed": "yes",
            "emergency patients assumed": "yes",
            "punctuality assumed": "yes",
            "objective function elements": {
                "waiting time": "yes",
                "idle time": "yes",
                "overtime": "yes"
            }
        },
        "Solution approach": "The method used is a generalization of the local search method, where the objective function is proved to be multimodular. The local search algorithm is guaranteed to find the optimal solution by evaluating the performance of a given schedule and iteratively improving it. Numerical examples demonstrate the effectiveness of this method in different scenarios of service time distributions and emergency arrivals.",
        "Solution approach summary": "A generalized local search method evaluates and iteratively improves schedules to find the optimal solution."
    },
    {
        "_comment": "The definition of overbooking is that more than one patient can be booked at the same time slot.",
        "Title": "Optimal outpatient appointment scheduling",
        "Authors": "Guido C. Kaandorp, Ger Koole",
        "Year": 2007,
        "BibTex ID": "kaandorp_optimal_2007",
        "Modeling Approach": {
            "time slot length": "fixed",
            "schedule format": "number of patients per time slot",
            "overbooking allowed": "yes",
            "service time": "exponential distribution",
            "no-shows assumed": "yes",
            "emergency patients assumed": "no",
            "punctuality assumed": "yes",
            "objective function elements": {
                "waiting time": "yes",
                "idle time": "yes",
                "overtime": "yes"
            }
        },
        "Solution approach": "The method involves a local search procedure that converges to the optimal schedule. The objective function is multimodular, which ensures that a locally optimal schedule is globally optimal. The algorithm evaluates the performance of a given schedule and iteratively improves it. Numerical examples demonstrate the effectiveness of the method under various conditions, including different service time distributions and no-shows.",
        "Solution approach summary": "A local search procedure ensures globally optimal schedules by evaluating and improving performance iteratively."
    },
    {
        "_comment": "The definition of overbooking is that more than one patient can be booked at the same time slot.",
        "Title": "Managing Appointment-Based Services in the Presence of Walk-in Customers",
        "Authors": "Shan Wang, Nan Liu, Guohua Wan",
        "Year": 2020,
        "BibTex ID": "wang_managing_2020",
        "Modeling Approach": {
            "time slot length": "fixed",
            "schedule format": "number of patients per time slot",
            "overbooking allowed": "yes",
            "service time": "general distribution",
            "no-shows assumed": "yes",
            "emergency patients assumed": "yes",
            "punctuality assumed": "yes",
            "objective function elements": {
                "waiting time": "yes",
                "idle time": "yes",
                "overtime": "yes"
            }
        },
        "Solution approach": "The method involves the development of optimization models that incorporate walk-in processes and heterogeneous, time-dependent no-show behaviors. The optimization model is multimodular, ensuring that a locally optimal schedule is also globally optimal. A two-stage stochastic linear programming model is proposed, which can be directly solved by off-the-shelf optimization packages. Extensive numerical experiments demonstrate the effectiveness of this approach in reducing costs significantly.",
        "Solution approach summary": "A two-stage stochastic linear programming model incorporates walk-in processes and heterogeneous no-show behaviors."
    },
    {
        "_comment": "The definition of overbooking is that more than one patient can be booked at the same time slot.",
        "Title": "Integer Programming Approaches for Appointment Scheduling with Random No-Shows and Service Durations",
        "Authors": "Ruiwei Jiang, Siqian Shen, Yiling Zhang",
        "Year": 2017,
        "BibTex ID": "jiang_integer_2017",
        "Modeling Approach": {
            "time slot length": "variable, results from schedule",
            "schedule format": "time interval, continuous",
            "overbooking allowed": "yes",
            "service time": "general distribution",
            "no-shows assumed": "yes",
            "emergency patients assumed": "no",
            "punctuality assumed": "yes",
            "objective function elements": {
                "waiting time": "yes",
                "idle time": "yes",
                "overtime": "yes"
            }
        },
        "Solution approach": "The paper develops distributionally robust (DR) optimization models to manage appointment scheduling under random no-shows and service durations. The models use integer programming techniques and include valid inequalities to strengthen the reformulations. The DR models adapt to different beliefs about no-show probabilities and derive convex hulls for special cases, yielding polynomial-sized linear programming models for these instances. The effectiveness of the approaches is demonstrated through extensive numerical experiments, highlighting the performance improvements under various levels of uncertainty and conservativeness.",
        "Solution approach summary": "Distributionally robust optimization models use integer programming to manage random no-shows and service durations."
    },
    {
        "_comment": "The definition of overbooking is that more than one patient can be booked at the same time slot.",
        "Title": "Improving Performance in Outpatient Appointment Services with a Simulation Optimization Approach",
        "Authors": "Kenneth J. Klassen, Reena Yoogalingam",
        "Year": 2009,
        "BibTex ID": "klassen_improving_2009",
        "Modeling Approach": {
            "time slot length": "variable, results from schedule",
            "schedule format": "appointment time, discrete",
            "overbooking allowed": "yes",
            "service time": "lognormal distribution",
            "no-shows assumed": "yes",
            "emergency patients assumed": "no",
            "punctuality assumed": "yes",
            "objective function elements": {
                "waiting time": "yes",
                "idle time": "yes",
                "overtime": "yes"
            }
        },
        "Solution approach": "The authors use a simulation optimization approach integrating metaheuristics like scatter search, tabu search, and neural networks. The model evaluates uncertainty through simulation, and the heuristic iteratively searches for optimal scheduling solutions. The performance of schedules is compared using various performance measures, and scenarios with different numbers of appointments, probabilities of no-shows, and session lengths are analyzed. The study finds that a 'plateau-dome' scheduling pattern is robust across different scenarios, balancing patient waiting time, doctor idle time, and overtime.",
        "Solution approach summary": "A simulation optimization approach integrates metaheuristics to iteratively search for optimal scheduling solutions."
    },
    {
        "_comment": "The definition of overbooking is that more than one patient can be booked at the same time slot.",
        "Title": "A Simulation Optimization Approach for the Appointment Scheduling Problem Under Uncertain Service Time and Patient No-Show",
        "Authors": "Tito Homem-de-Mello, Qingxia Kong, Rodrigo Godoy Barba",
        "Year": 2022,
        "BibTex ID": "homem-de-mello_simulation_2022",
        "Modeling Approach": {
            "time slot length": "variable, results from schedule",
            "schedule format": "time interval, continuous",
            "overbooking allowed": "no",
            "service time": "general distribution",
            "no-shows assumed": "yes",
            "emergency patients assumed": "no",
            "punctuality assumed": "yes",
            "objective function elements": {
                "waiting time": "yes",
                "idle time": "yes",
                "overtime": "yes"
            }
        },
        "Solution approach": "The authors propose a simulation optimization approach to tackle the appointment scheduling problem with time-dependent no-show probabilities and stochastic service times. The method involves estimating gradients of the objective function through Monte Carlo simulations and applying a projected gradient path (PGP) algorithm. The approach integrates techniques from the STRONG method, originally designed for unconstrained problems, and adapts them for constrained stochastic optimization problems. The model accounts for decision-dependent uncertainties, providing solutions that minimize the total expected cost, which includes waiting time, idle time, and overtime costs. Numerical experiments demonstrate significant cost reductions, highlighting the effectiveness of considering time-dependent no-show behaviors in the scheduling process.",
        "Solution approach summary": "A simulation optimization approach uses Monte Carlo simulations and a projected gradient path algorithm."
    },
    {
        "_comment": "The definition of overbooking is that more than one patient can be booked at the same time slot.",
        "Title": "A flexible and optimal approach for appointment scheduling in healthcare",
        "Authors": "Johan A. W. Kuiper, Riël C. M. Toussaint, Marco J. C. Bijvank",
        "Year": 2023,
        "BibTex ID": "kuiper_flexible_2023",
        "Modeling Approach": {
            "time slot length": "variable",
            "schedule format": "time interval, continuous",
            "overbooking allowed": "no",
            "service time": "phase-type distribution",
            "no-shows assumed": "yes",
            "emergency patients assumed": "yes",
            "punctuality assumed": "no",
            "objective function elements": {
                "waiting time": "yes",
                "idle time": "yes",
                "overtime": "yes"
            }
        },
        "Solution approach": "The authors propose a method based on phase-type distribution approximations for service times. This approach leverages the ability of phase-type distributions to approximate any positive distribution with arbitrary accuracy. The method also incorporates no-shows and walk-ins, along with session overtime into the objective function. They employ a mathematical framework to minimize a weighted average of idle time for servers and waiting time for patients, with penalties for overtime. The proposed approach provides a flexible tool that can adapt to different service time distributions and scheduling conditions, with performance comparisons to other methods showing its effectiveness.",
        "Solution approach summary": "A method using phase-type distribution approximations minimizes idle time and waiting time with penalties for overtime."
    },
    {
        "_comment": "The definition of overbooking is that more than one patient can be booked at the same time slot.",
        "Title": "A Computational approach to optimized appointment scheduling",
        "Authors": "Bart M. Kuiper, Enrico G. T. van den Akker, Martijn Mes, Richard J. Boucherie",
        "Year": 2015,
        "BibTex ID": "kuiper_computational_2015",
        "Modeling Approach": {
            "time slot length": "variable, results from schedule",
            "schedule format": "appointment time, continuous",
            "overbooking allowed": "no",
            "service time": "general distribution",
            "no-shows assumed": "no",
            "emergency patients assumed": "no",
            "punctuality assumed": "yes",
            "objective function elements": {
                "waiting time": "yes",
                "idle time": "yes",
                "overtime": "no"
            }
        },
        "Solution approach": "The paper proposes a computational approach using phase-type distributions to approximate service times. This allows for the derivation of the sojourn-time distribution of each client and the computation of the objective function, which includes waiting time, idle time, and overtime. The approach handles both sequential and simultaneous optimization, and it supports both linear and quadratic loss functions. The sequential approach optimizes for each arriving client given previous arrivals, while the simultaneous approach jointly minimizes the objective for all clients. The model considers the first and second moments of service times and uses phase-type distributions to facilitate calculations. The approach also accommodates no-shows by adjusting the probability distributions accordingly.",
        "Solution approach summary": "A computational approach uses phase-type distributions to approximate service times for sequential and simultaneous optimization."
    },
    {
        "_comment": "The definition of overbooking is that more than one patient can be booked at the same time slot.",
        "Title": "Multimodularity in the Stochastic Appointment Scheduling Problem with Discrete Arrival Epochs",
        "Authors": "Christos Zacharias, Tallys Yunes",
        "Year": 2020,
        "BibTex ID": "zacharias_multimodularity_2020",
        "Modeling Approach": {
            "time slot length": "fixed",
            "schedule format": "number of patients per time slot",
            "overbooking allowed": "yes",
            "service time": "general distribution",
            "no-shows assumed": "yes",
            "emergency patients assumed": "yes",
            "punctuality assumed": "no",
            "objective function elements": {
                "waiting time": "yes",
                "idle time": "yes",
                "overtime": "yes"
            }
        },
        "Solution approach": "The authors propose a novel method for designing optimal appointment schedules that account for stochastic elements such as patient no-shows, nonpunctuality, general stochastic service times, and emergency walk-ins. The problem is modeled as a nonlinear integer program, leveraging the multimodularity property of the objective function. This property ensures that a locally optimal schedule is also globally optimal, which is achieved using a polynomial-time algorithm for minimizing a multimodular function. The study introduces recursive expressions for performance measures and employs discrete convex analysis and submodular set-function minimization over ring families.",
        "Solution approach summary": "A novel method uses nonlinear integer programming and multimodularity to ensure globally optimal schedules."
    },
    {
        "_comment": "The definition of overbooking is that more than one patients can be booked at the same time slot.",
        "Title": "Scheduling Arrivals to a Stochastic Service Delivery System Using Copositive Cones",
        "Authors": "Qingxia Kong, Chung-Yee Lee, Chung-Piaw Teo, Zhichao Zheng",
        "Year": 2013,
        "BibTex ID": "qingxia_kong_scheduling_2013",
        "Modeling Approach": {
            "time slot length": "variable, results from schedule",
            "schedule format": "time interval, continuous",
            "overbooking allowed": "yes",
            "service time": "general distribution",
            "no-shows assumed": "no",
            "emergency patients assumed": "no",
            "punctuality assumed": "yes",
            "objective function elements": {
                "waiting time": "yes",
                "idle time": "no",
                "overtime": "yes"
            }
        },
        "Solution approach": "The article develops a convex conic programming approach to solve the appointment-scheduling problem. It is formulated as a two-stage stochastic optimization problem, with the second stage capturing waiting times using a network flow model. The first stage employs a minimax approach to design a schedule that minimizes the maximum expected cost across a family of distributions. A tractable semidefinite approximation to the copositive programming problem is solved to obtain near-optimal schedules, validated through numerical experiments and practical application in a clinical setting.",
        "Solution approach summary": "A convex conic programming approach uses a two-stage stochastic optimization problem to minimize maximum expected cost."
    },
    {
        "_comment": "The definition of overbooking is that more than one patients can be booked at the same time slot.",
        "Title": "Strategies for Appointment Policy Design with Patient Unpunctuality",
        "Authors": "Kenneth J. Klassen, Reena Yoogalingam",
        "Year": 2014,
        "BibTex ID": "klassen_strategies_2014",
        "Modeling Approach": {
            "time slot length": "variable, results from schedule",
            "schedule format": "appointment time, integer",
            "overbooking allowed": "no",
            "service time": "lognormal distribution",
            "no-shows assumed": "yes",
            "emergency patients assumed": "no",
            "punctuality assumed": "no",
            "objective function elements": {
                "waiting time": "yes",
                "idle time": "yes",
                "overtime": "yes"
            }
        },
        "Solution approach": "The study employs a simulation optimization framework to design appointment schedules in the presence of patient unpunctuality. The model integrates data from multiple outpatient clinics and uses a normal distribution to represent patient unpunctuality. The authors explore various scheduling rules, including fixed and variable interval schedules with single and multiple patient blocks. The study examines the effects of different levels of patient unpunctuality, no-shows, physician lateness, and interruptions on clinic performance. The best-performing scheduling policies are identified, with a focus on minimizing the weighted cost of patient waiting time, physician idle time, and clinic overtime. The study suggests general rules for practical implementation to mitigate the effects of patient unpunctuality.",
        "Solution approach summary": "A simulation optimization framework explores various scheduling rules to design effective schedules under patient unpunctuality."
    },
    {
        "_comment": "The definition of overbooking is that more than one patients can be booked at the same time slot.",
        "Title": "Outpatient scheduling with unpunctual patients and no-shows: A queueing approach",
        "Authors": "Matthias Deceuninck, Dieter Fiems, Stijn De Vuyst",
        "Year": 2018,
        "BibTex ID": "deceuninck_outpatient_2018",
        "Modeling Approach": {
            "time slot length": "fixed",
            "schedule format": "appointment time, integer",
            "overbooking allowed": "yes",
            "service time": "lognormal distribution",
            "no-shows assumed": "yes",
            "emergency patients assumed": "no",
            "punctuality assumed": "no",
            "objective function elements": {
                "waiting time": "yes",
                "idle time": "yes",
                "overtime": "yes"
            }
        },
        "Solution approach": "The solution approach involves a numerical methodology for evaluating outpatient schedules that explicitly accounts for no-shows and patient unpunctuality. The authors use the transient solution of a modified Lindley recursion, allowing explicit expressions for each performance measure. This is achieved in a discrete-time (slotted) setting, simplifying the computations. The analysis is based on a discrete-time queueing model with a two-dimensional state space representing the amount of work in the queue and the unpunctuality on effective patient arrival times. The approach does not require assumptions on the consultation times other than their independence and known distributions. It includes the use of a local search algorithm to optimize scheduling.",
        "Solution approach summary": "A numerical methodology using a modified Lindley recursion evaluates schedules accounting for no-shows and unpunctuality."
    },
    {
    "_comment": "The definition of overbooking is that more than one patients can be booked at the same time slot.",
    "Title": "A Universal Appointment Rule in the Presence of No-Shows and Walk-Ins",
    "Authors": "Tugba Cayirli, Kum Khiong Yang, Ser Aik Quek",
    "Year": 2012,
    "BibTex ID": "cayirli-universal-2012",
    "Modeling Approach": {
        "time slot length": "variable",
        "schedule format": [
            "number of patients per time slot",
            "appointment time, integer"
        ],
        "overbooking allowed": "yes",
        "service time": "lognormal distribution",
        "no-shows assumed": "yes",
        "emergency patients assumed": "yes",
        "punctuality assumed": "yes",
        "objective function elements": {
            "waiting time": "yes",
            "idle time": "yes",
            "overtime": "yes"
        }
    },
    "Solution approach": "The study introduces a 'Dome' appointment rule that uses simulation and nonlinear regression to predict the planning constant as a function of various environmental factors such as no-shows, walk-ins, number of appointments per session, variability of service times, and cost of doctor’s time to patients’ time. The approach adjusts the mean and standard deviation of service times based on the expected probabilities of no-shows and walk-ins to explicitly minimize their disruptive effects. An open-source decision-support tool is also provided to help healthcare managers develop appointment schedules tailored to their clinical environment.",
    "Solution approach summary": "The 'Dome' rule is parameterized using simulation and nonlinear regression to accommodate no-shows and walk-ins.",
    "_log": "<html><body><p>The provided article, titled 'A Universal Appointment Rule in the Presence of No-Shows and Walk-Ins', authored by Tugba Cayirli, Kum Khiong Yang, and Ser Aik Quek, and published in 2012, introduces a universal 'Dome' appointment rule.</p><p>The article outlines a comprehensive modeling approach:</p><ul><li>Time slot length is variable, resulting from the schedule.</li><li>Schedule format is defined by the number of patients per time slot and appointment time in integer values.</li><li>Overbooking is allowed as the model explicitly considers the possibility of more than one patient being booked in the same time slot.</li><li>Service times are modeled using a lognormal distribution.</li><li>No-shows are assumed, and they are decision-dependent.</li><li>Emergency patients (walk-ins) are assumed.</li><li>Punctuality is assumed for scheduled patients.</li><li>The objective function elements include waiting time, idle time, and overtime.</li></ul><p>The solution approach employs simulation and nonlinear regression to derive an equation that predicts the planning constant as a function of the environmental factors. It also introduces an adjustment procedure that modifies the mean and standard deviation of service times based on the expected probabilities of no-shows and walk-ins. This procedure aims to minimize their disruptive effects, improving the overall performance of the appointment system. The study provides an open-source decision-support tool to assist healthcare managers in developing appointment schedules tailored to their specific clinical environments.</p><p>For the BibTeX ID, 'cayirli-universal-2012' was created based on the first author's last name, the first word in the title, and the year of publication.</p></body></html>"
}

]
